Merge branch 'dwgx:master' into master
